 <?php
/**
 * 第一种情况:有一个数组b,将一个值拼接到b里的键值中
 * 将数组b里的值进行拼接
 */
$a = '湖北'; 	
$c = array();
$b = array(
 	'a'=>'武汉',
 	'b'=>'黄石',
 	'c'=>'黄冈',
 	'd'=>'孝感'
 	);
foreach($b as $k=>$v)
{
	//$c[] = $a.$v;
	//下标不变的写法:$c[$k] = $a.$v;
	$c[$k] = $a.$v;
}
print_r($c);
/**
 *新数组 
Array
(
    [0] => 湖北武汉
    [1] => 湖北黄石
    [2] => 湖北黄冈
    [3] => 湖北孝感
)

foreach($b as $k=>$v)
{
	//下标不变的写法:$c[$k] = $a.$v;
	$c[$k] = $a.$v;
}
print_r($c);得到如下结果
 Array
(
    [a] => 湖北武汉
    [b] => 湖北黄石
    [c] => 湖北黄冈
    [d] => 湖北孝感
 /

